server/performance-tests/test-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: compare-with-without-cache.js
        output: -

     scenarios: (100.00%) 2 scenarios, 51 max VUs, 10m30s max duration (incl. graceful stop):
              * cold_cache: 1 iterations for each of 1 VUs (maxDuration: 10m0s, exec: testColdCache, gracefulStop: 30s)
              * warm_cache: 50 looping VUs for 2m0s (exec: testWarmCache, startTime: 10s, gracefulStop: 30s)

time="2026-01-27T13:28:59+07:00" level=info msg="🚀 Starting cache performance comparison test" source=console
time="2026-01-27T13:28:59+07:00" level=info msg="📊 This will measure:" source=console
time="2026-01-27T13:28:59+07:00" level=info msg="   - Cold cache performance (first request)" source=console
time="2026-01-27T13:28:59+07:00" level=info msg="   - Warm cache performance (subsequent requests)" source=console
time="2026-01-27T13:28:59+07:00" level=info msg="   - Cache hit ratio" source=console
time="2026-01-27T13:28:59+07:00" level=info source=console
time="2026-01-27T13:28:59+07:00" level=info msg="Login response status: 500" source=console
time="2026-01-27T13:28:59+07:00" level=info msg="Login response body: {\"timestamp\":\"2026-01-27T13:28:59.472996\",\"status\":500,\"message\":\"Internal server error\",\"path\":\"/api/v1/auth/login\"}" source=console
time="2026-01-27T13:28:59+07:00" level=error msg="❌ Failed to get token from login response" source=console
time="2026-01-27T13:28:59+07:00" level=error msg="Response: {\"timestamp\":\"2026-01-27T13:28:59.472996\",\"status\":500,\"message\":\"Internal server error\",\"path\":\"/api/v1/auth/login\"}" source=console


  █ TOTAL RESULTS 

    HTTP
    http_req_duration...: avg=12.11ms min=12.11ms med=12.11ms max=12.11ms p(90)=12.11ms p(95)=12.11ms
    http_req_failed.....: 100.00% 1 out of 1
    http_reqs...........: 1       67.326466/s

    NETWORK
    data_received.......: 520 B   35 kB/s
    data_sent...........: 195 B   13 kB/s



Run          [ 100% ] setup()
cold_cache   [   0% ]
warm_cache   [   0% ]
time="2026-01-27T13:28:59+07:00" level=error msg="Error: Login failed - no token received\n\tat setup (file:///Users/wongun78/Vault/cong2008/quiz-app-v2/server/performance-tests/compare-with-without-cache.js:64:11(106))\n" hint="script exception"